# FreeFormElement Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FreeFormElement Class
Members See Also
---
A Free Form Element that contains non-parametric geometry created from an input solid outline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class FreeFormElement : GenericForm
```

Visual Basic
---
```text
Public Class FreeFormElement _
	Inherits GenericForm
```

Visual C++
---
```text
public ref class FreeFormElement : public GenericForm
```

# Remarks
The element can participate in joins and void cuts with other combinable elements.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CombinableElement Autodesk.Revit.DB..::..GenericForm Autodesk.Revit.DB..::..FreeFormElement
# See Also
FreeFormElement Members
Autodesk.Revit.DB Namespace